# Dealing with Missing Values

In [2]:
import numpy as np
import pandas as pd

In [20]:
#Create Data
myData = {"crop" : ["Rice", "Wheat", "Corn", "Parley"],
         "Yield" : [1200, 1100, 980, 800],
         "Cost": [100, 102, np.nan, 93]}
crops = pd.DataFrame(myData)

In [5]:
crops

     crop  Yield   Cost
0    Rice   1200  100.0
1   Wheat   1100  102.0
2    Corn    980    NaN
3  Parley    800   93.0

In [6]:
#Check Missing Values

#isnull

crops.isnull()

    crop  Yield   Cost
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False

In [7]:
crops.notnull()

   crop  Yield   Cost
0  True   True   True
1  True   True   True
2  True   True  False
3  True   True   True

In [9]:
# Count number of missing values

crops.isnull().sum()

crop     0
Yield    0
Cost     1
dtype: int64

In [10]:
#Show rows with missing values

crops[crops.Cost.isnull()]

   crop  Yield  Cost
2  Corn    980   NaN

In [11]:
#Shows which crop has missing values
crops[crops.Cost.isnull()].crop

2    Corn
Name: crop, dtype: object

In [15]:
#Drop NA
x = crops.dropna(how = 'all').shape

In [17]:
x2 = crops
x2.dropna(inplace = True)
x2

     crop  Yield   Cost
0    Rice   1200  100.0
1   Wheat   1100  102.0
3  Parley    800   93.0

In [21]:
#Create DataFrame for Crops again i.e Run 2 again

crops

     crop  Yield   Cost
0    Rice   1200  100.0
1   Wheat   1100  102.0
2    Corn    980    NaN
3  Parley    800   93.0

In [23]:
#Imputation of Missing Values

crops.Cost.fillna(value = "unknown", inplace = True)

crops

     crop  Yield     Cost
0    Rice   1200    100.0
1   Wheat   1100    102.0
2    Corn    980  unknown
3  Parley    800     93.0